In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [15]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[7,4,1,2],[2,3,6,9],[0,2,5,8]], columns=['a','b','c','d'])

In [16]:
df1

   a  b  c  d
0  1  2  3  4
1  5  6  7  8
2  7  4  1  2
3  2  3  6  9
4  0  2  5  8

In [6]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [7]:
df1.tail(2)

   0  1  2  3
3  2  3  6  9
4  0  2  5  8

In [8]:
df1

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  7  4  1  2
3  2  3  6  9
4  0  2  5  8

In [9]:
df1.shape

(5, 4)

In [13]:
df1.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7